app/views/posts/show.html.erb

<div id="comments">
  <h2><%= @post.comments.count %> Comments</h2>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 4]]