app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Gilad"], ["body", "first comment"], ["post_id", 4], ["created_at", "2017-10-08 22:37:33.874106"], ["updated_at", "2017-10-08 22:37:33.874106"]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.user = current_user

    if @post.save