app/controllers/posts_controller.rb

  def index
    @posts = Post.order('created_at DESC')
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hello"], ["body", "sdfsdfsdfsdfsd"], ["created_at", "2017-10-08 19:13:34.475382"], ["updated_at", "2017-10-08 19:13:34.475382"]]

  def update
    @post = Post.find(params[:id])

    if @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "body" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["body", "different 34"], ["updated_at", "2017-10-08 21:00:34.035867"], ["id", 7]]